app/views/pages/events.html.erb

SELECT "eattributes".* FROM "eattributes" WHERE "eattributes"."event_id" = ?  [["event_id", 8]]
---
			タグ：
			<% event.eattributes.each do |attribute| %>

SELECT COUNT(*) FROM "eusers" WHERE "eusers"."event_id" = ?  [["event_id", 8]]
---
					<td>
						<p><%= event.eusers.count %>人/ <%= event.number %>人