app/views/pages/mypage.html.erb

<!-- <br> -->
タグ:<% @user.uattributes.each do |attribute| %>
---
SELECT "attributes".* FROM "attributes"
SELECT "uattributes".* FROM "uattributes" WHERE "uattributes"."user_id" = ?  [["user_id", 11]]

        <td><%= euser.event.date.month %>月<%= euser.event.date.day %>日</td>
        <td><%= euser.event.eusers.count %></td>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT COUNT(*) FROM "eusers" WHERE "eusers"."event_id" = ?  [["event_id", 20]]