app/views/pages/obog.html.erb

	<% end %>
	<% user.uattributes.each do |attribute| %>
---
SELECT "uattributes".* FROM "uattributes" WHERE "uattributes"."user_id" = ?  [["user_id", 7]]