orange/app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def top
		if session[:id]
		@user = User.find(session[:id])