orange/app/controllers/pages_controller.rb

INSERT INTO "users" ("name", "password", "schoolname", "guraduate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "youse"], ["password", "nwvknwvk"], ["schoolname", "灘"], ["guraduate", 18], ["created_at", "2018-12-05 14:46:55.643662"], ["updated_at", "2018-12-05 14:46:55.643662"]]
---
	def signup_user
		username = params[:username]
		password = params[:password]
		graduate = params[:graduate]
		schoolname = params[:schoolname]
		phone = params[:phone]
		email = params[:email]

		user = User.new
 		user.name = username
		user.password = password
		user.guraduate = graduate
		user.schoolname = schoolname
		user.email = email
		user.phone = phone
		if user.save

SELECT "users".* FROM "users" WHERE (name = 'youse' and password = 'nwvknwvk')
---
	def signin_check
		username = params[:username]
		password = params[:password]

		users = User.where("name = ? and password = ?",username ,password)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit_profile
		@user = User.find(session[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "email" = ?, "phone" = ?, "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", nil], ["email", "yousecome625@gmail.com"], ["phone", "08031192558"], ["profile", "よろしこ"], ["updated_at", "2018-12-23 15:48:14.300848"], ["id", 3]]
---
	def update_profile
		username = params[:username]
		password = params[:password]
		graduate = params[:graduate]
		schoolname = params[:schoolname]
		phone = params[:phone]
		email = params[:email]
		profile = params[:profile]

		user = User.find(session[:id])
		password = user.password
 		user.name = username
		user.password = password
		user.guraduate = graduate
		user.schoolname = schoolname
		user.email = email
		user.phone = phone
		user.profile = profile
		user.password = password
		user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attributes".* FROM "attributes"
SELECT "eusers".* FROM "eusers" WHERE "eusers"."name" = ?  [["name", "9"]]
---
	def mypage
		if session[:id]
			@user = User.find(session[:id])
			@attributes = Attribute.all
			@eusers = Euser.where(name: session[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "eusers".* FROM "eusers" WHERE (name = 9 and event_id = '1')
INSERT INTO "eusers" ("name", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?)  [["name", "9"], ["created_at", "2018-12-17 01:34:10.986427"], ["updated_at", "2018-12-17 01:34:10.986427"], ["event_id", 1]]
---
	def participate
		event = Event.find(params[:id])
		exists = Euser.where("name = ? and event_id = ?",session[:id] ,params[:id] )
		exist = exists[0];

		if !exist

		euser = Euser.new
		euser.name = session[:id]
		euser.event = event
		euser.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "eusers".* FROM "eusers" WHERE (name = 9 and event_id = '1')
---
	def participate_cancel
		event = Event.find(params[:id])
		exists = Euser.where("name = ? and event_id = ?",session[:id] ,params[:id] )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."schoolname" = ?  [["schoolname", "東大"]]
---
	def events
		if session[:id]
			@user = User.find(session[:id])
			@events = Event.where(schoolname: @user.schoolname)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "uattributes".* FROM "uattributes" WHERE "uattributes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "uattributes" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "{\"name\"=>\"1\"}"], ["created_at", "2018-12-08 05:09:15.104180"], ["updated_at", "2018-12-08 05:09:15.104180"], ["user_id", 3]]
---
	def add_attributes
		name = params[:attribute][:name]
		user = User.find(session[:id])

		exists = Uattribute.where("name = ? and user_id = ?",name ,user.id )
		exist = exists[0];

		if !exist

		uattribute = Uattribute.new
		uattribute.name = name

		uattribute.user = user

		uattribute.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."schoolname" = ?  [["schoolname", "てすと"]]
---
	def obog
		if session[:id]
			@user = User.find(session[:id])
			@users = User.where(schoolname: @user.schoolname)

INSERT INTO "attributes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "科学"], ["created_at", "2018-12-08 05:05:21.941369"], ["updated_at", "2018-12-08 05:05:21.941369"]]
---
	def create_attributes
		l_category = params[:l_category]

		attribute = Attribute.new
		attribute.name = l_category

		attribute.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "uattributes".* FROM "uattributes" WHERE "uattributes"."user_id" = ?  [["user_id", 3]]
---
	def delete_attributes
		user = User.find(session[:id])
		exists = Uattribute.where("id = ? and user_id = ?",params[:id] ,user.id )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "events" ("name", "content", "number", "schoolname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "webp"], ["content", "わーいわーい"], ["number", 100], ["schoolname", "東大"], ["created_at", "2018-12-17 01:09:12.354589"], ["updated_at", "2018-12-17 01:09:12.354589"]]
INSERT INTO "eattributes" ("name", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?)  [["name", "科学"], ["created_at", "2018-12-17 01:09:12.371544"], ["updated_at", "2018-12-17 01:09:12.371544"], ["event_id", 1]]
---
	def create_events
		user = User.find(session[:id])
		name = params[:name]
		content = params[:content]
		number = params[:number]
		attribute = params[:eattribute][:name]
		place = params[:place]
		fee = params[:fee]
		edate = Time.new(params[:period_to][:year],params[:period_to][:month],params[:period_to][:day],params[:period_to][:hour],params[:period_to][:minute])

		event = Event.new
		event.name = name
		event.content = content
		event.date = edate
		event.number = number
		event.schoolname = user.schoolname
		event.place = place
		event.fee = fee
		event.ownerid = session[:id]

		if event.save
			eattribute = Eattribute.new
			eattribute.name = attribute
			eattribute.event = event
			eattribute.save

INSERT INTO "evowners" ("name", "phone", "email", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "youse"], ["phone", "08031192558"], ["email", "yousecome625@gmail.com"], ["created_at", "2018-12-23 16:35:42.657767"], ["updated_at", "2018-12-23 16:35:42.657767"], ["event_id", 7]]
---
			evowner.phone = user.phone
			evowner.email = user.email
			evowner.event = event
			evowner.save