orange/app/views/pages/events.html.erb

	<div>開催日時　<%= event.date %> </div><br>
	<div>参加者　　<%= event.eusers.count %>人/ <%= event.number %>人 </div><br>
	<% event.eattributes.each do |attribute| %>
---
SELECT COUNT(*) FROM "eusers" WHERE "eusers"."event_id" = ?  [["event_id", 1]]
SELECT "eattributes".* FROM "eattributes" WHERE "eattributes"."event_id" = ?  [["event_id", 1]]