orange/app/views/pages/mypage.html.erb

SELECT "attributes".* FROM "attributes"
SELECT "uattributes".* FROM "uattributes" WHERE "uattributes"."user_id" = ?  [["user_id", 3]]
---
<div>卒業年度　<%= @user.guraduate %> </div><br>
<% @user.uattributes.each do |attribute| %>