orange/app/views/pages/obog.html.erb

	<div>卒業年度　<%= user.guraduate %> </div><br>
	<% user.uattributes.each do |attribute| %>
---
SELECT "uattributes".* FROM "uattributes" WHERE "uattributes"."user_id" = ?  [["user_id", 8]]