app/controllers/pages_controller.rb

INSERT INTO "users" ("name", "password", "schoolname", "guraduate", "created_at", "updated_at", "email", "phone") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def signup_user
		username = params[:username]
		password = params[:password]
		graduate = params[:graduate]
		schoolname = params[:schoolname]
		phone = params[:phone]
		email = params[:email]

		user = User.new
 		user.name = username
		user.password = password
		user.guraduate = graduate
		user.schoolname = schoolname
		user.email = email
		user.phone = phone
		if user.save

SELECT "users".* FROM "users" WHERE (name = 'youse' and password = 'nwvknwvk')
---
	def signin_check
		username = params[:username]
		password = params[:password]

		users = User.where("name = ? and password = ?",username ,password)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
	def edit_profile
		@user = User.find(session[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "phone" = ?, "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "aho@hoge"], ["phone", "420"], ["profile", "アホです"], ["updated_at", "2019-01-04 07:01:24.477616"], ["id", 9]]
---
	def update_profile
		username = params[:username]
		password = params[:password]
		graduate = params[:graduate]
		schoolname = params[:schoolname]
		phone = params[:phone]
		email = params[:email]
		profile = params[:profile]

		user = User.find(session[:id])
		password = user.password
 		user.name = username
		user.password = password
		user.guraduate = graduate
		user.schoolname = schoolname
		user.email = email
		user.phone = phone
		user.profile = profile
		user.password = password
		user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "attributes".* FROM "attributes"
SELECT "eusers".* FROM "eusers" WHERE "eusers"."name" = ?  [["name", "11"]]
---
	def mypage
		if session[:id]
			@user = User.find(session[:id])
			@attributes = Attribute.all
			@eusers = Euser.where(name: session[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "eusers".* FROM "eusers" WHERE (name = 11 and event_id = '16')
INSERT INTO "eusers" ("name", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?)  [["name", "11"], ["created_at", "2018-12-26 16:52:10.591661"], ["updated_at", "2018-12-26 16:52:10.591661"], ["event_id", 16]]
---
	def participate
		event = Event.find(params[:id])
		exists = Euser.where("name = ? and event_id = ?","#{session[:id]}" ,params[:id] )
		exist = exists[0];

		if !exist

		euser = Euser.new
		euser.name = session[:id]
		euser.event = event
		euser.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "eusers".* FROM "eusers" WHERE (name = 11 and event_id = '16')
---
	def participate_cancel
		event = Event.find(params[:id])
		exists = Euser.where("name = ? and event_id = ?","#{session[:id]}" ,params[:id]  )

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."schoolname" = ?  [["schoolname", "rwrwrtw"]]
---
	def events
		if session[:id]
			@user = User.find(session[:id])
			@events = Event.where(schoolname: @user.schoolname)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "uattributes".* FROM "uattributes" WHERE (name = '科学' and user_id = 11)
INSERT INTO "uattributes" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "科学"], ["created_at", "2018-12-26 16:34:54.650640"], ["updated_at", "2018-12-26 16:34:54.650640"], ["user_id", 11]]
---
	def add_attributes
		name = params[:attribute][:name]
		user = User.find(session[:id])

		exists = Uattribute.where("name = ? and user_id = ?",name ,user.id )
		exist = exists[0];

		if !exist

		uattribute = Uattribute.new
		uattribute.name = name

		uattribute.user = user

		uattribute.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."schoolname" = ?  [["schoolname", "生成アルゴリズムｇｔあ"]]
---
	def obog
		if session[:id]
			@user = User.find(session[:id])
			@users = User.where(schoolname: @user.schoolname)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "events" ("name", "content", "date", "number", "schoolname", "created_at", "updated_at", "ownerid", "place", "fee") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "eattributes" ("name", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?)  [["name", "科学"], ["created_at", "2018-12-26 16:10:44.994814"], ["updated_at", "2018-12-26 16:10:44.994814"], ["event_id", 8]]
---
	def create_events
		user = User.find(session[:id])
		name = params[:name]
		content = params[:content]
		number = params[:number]
		attribute = params[:eattribute][:name]
		place = params[:place]
		fee = params[:fee]
		edate = Time.new(params[:period_to][:year],params[:period_to][:month],params[:period_to][:day],params[:period_to][:hour],params[:period_to][:minute])

		event = Event.new
		event.name = name
		event.content = content
		event.date = edate
		event.number = number
		event.schoolname = user.schoolname
		event.place = place
		event.fee = fee
		event.ownerid = session[:id]

		if event.save
			eattribute = Eattribute.new
			eattribute.name = attribute
			eattribute.event = event
			eattribute.save

INSERT INTO "evowners" ("name", "phone", "email", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "youse"], ["phone", "7"], ["email", "4w5w5"], ["created_at", "2018-12-26 16:10:45.078562"], ["updated_at", "2018-12-26 16:10:45.078562"], ["event_id", 8]]
---
			evowner.phone = user.phone
			evowner.email = user.email
			evowner.event = event
			evowner.save